src/Catalogs/СпискиИнформационныхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>СпискиИнформационныхБаз</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ДоступКСпискамИнформационныхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ДоступКСпискамИнформационныхБаз</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПризнакИзменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ClientID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПубликацияВебСервиса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПубликацииВебСервисов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСпискиОбщихИБ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СписокОбщихИБ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпискиИнформационныхБаз</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/СпискиИнформационныхБаз/Ext/ObjectModule.bsl
//
//
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоНовый() И НЕ Отказ Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДоступКСпискамОбщихИБДоступныеСпискиОбщихИБ.Ссылка
		|ИЗ
		|	Справочник.ДоступКСпискамИнформационныхБаз.ДоступныеСпискиОбщихИБ КАК ДоступКСпискамОбщихИБДоступныеСпискиОбщихИБ
		|ГДЕ
		|	ДоступКСпискамОбщихИБДоступныеСпискиОбщихИБ.СписокОбщихИБ = &СписокОбщихИБ";	
		Запрос.УстановитьПараметр("СписокОбщихИБ", ЭтотОбъект.Ссылка);		
		Выборка = Запрос.Выполнить().Выбрать();		
		Пока Выборка.Следующий() Цикл
			ТекущийОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ТекущийОбъект.Записать();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
